---
type: DuctSizeSettings
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 9
tags: [revit-api, class]
---

# DuctSizeSettings

`Autodesk.Revit.DB.Mechanical.DuctSizeSettings` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSize | 2013 | `public void AddSize ( DuctShape shape , MEPSize sizeInfo )` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetDuctSizeSettingIterator | — | `public DuctSizeSettingIterator GetDuctSizeSettingIterator ()` |
| Method | GetDuctSizeSettings | 2013 | `public static DuctSizeSettings GetDuctSizeSettings ( Document aDoc )` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyValuePair < DuctShape , DuctSizes >> GetEnumerator ()` |
| Method | GetSizeCount | 2013 | `public int GetSizeCount ( DuctShape shape )` |
| Method | RemoveSize | 2013 | `public void RemoveSize ( DuctShape shape , double nominalDiameter )` |
| Property | Item | 2012 | `public DuctSizes this [ DuctShape ductShape ] { get ; }` |
| Property | Parameter | — | `` |